#+title: Emacs Configuration file in org mode
#+PROPERTY: header-args:bash :tangle ~/.bashrc
 
** Z jumping
#+begin_src bash

# inject z into path variable for easy access of custom scripts
ADDIN=`pwd`"/repos/z"
if [ ` (echo $PATH) | grep repos/z` ] ;
then  echo "Z already in path.";
else export PATH=$PATH:$ADDIN;
fi


# inserts the z program and path for easy jumping. Must have z.sh in bin below. /mnt/c/Users/undrg/.local/bin/z.sh
ZPROG='. ~/repos/z/z.sh'

eval $ZPROG

#+end_src

#+RESULTS:
: Z already in path.

** Adding custom Paths  
#+begin_src bash
MATLAB_PATH="/usr/local/MATLAB/R2023a/bin"
if [ ` (echo $PATH) | grep MATLAB` ] ;
then  echo "Matlab already in path.";
else export PATH=$PATH:$MATLAB_PATH;
fi

PRUSA_PATH="/home/speedy/PrusaSlicer/build/src" 
if [ ` (echo $PATH) | grep /home/speedy/PrusaSlicer/build/src` ] ;
then  echo "prusa already in path.";
else export PATH=$PATH:$PRUSA_PATH;
fi

RENDERDOC_PATH="/home/speedy/.local/bin/renderdoc_1.26/bin" 
if [ ` (echo $PATH) | grep /home/speedy/.local/bin/renderdoc_1.26/bin` ] ;
then  echo "renderdoc already present already in path.";
else export PATH=$PATH:$RENDERDOC_PATH;
fi

EXA_PATH="/home/speedy/exa/target/debug" 
if [ ` (echo $PATH) | grep /home/speedy/exa/target/debug` ] ;
then  echo "renderdoc already present already in path.";
else export PATH=$PATH:$EXA_PATH;
fi

ADS_PATH="/usr/local/ADS2023_Update2/bin:/usr/local/ADS2023_Update2/bin/Licensing/2023.02/bin" 
if [ ` (echo $PATH) | grep ADS` ] ;
then  echo "ADS already present already in path.";
else export PATH=$PATH:$ADS_PATH;
fi

#+end_src

#+RESULTS:
| Matlab    | already | in      | path.   |    |       |
| prusa     | already | in      | path.   |    |       |
| renderdoc | already | present | already | in | path. |
| renderdoc | already | present | already | in | path. |

